# https://www.acmicpc.net/problem/2097

'''
당신은 N개의 조약돌을 가지고 있다. 이 조약돌을 좌표평면의 격자점 위에 아무렇게나 떨어뜨렸다. 

격자점이란, x좌표와 y좌표 모두가 정수인 지점을 말한다. 

이를테면 (1, 1)이나 (0, -9)는 격자점이며, (-2, 3.5)이나 (π, 7.14)는 격자점이 아니다.

모든 조약돌을 포함하는 가장 작은 직사각형을 생각할 수 있다. 

예를 들어 세 개의 조약돌을 (2,4), (4, 8), (5,5)에 떨어뜨렸다면, 이 세 조약돌을 모두 포함하는 가장 작은 직사각형은 가로 3, 세로 4인 직사각형이다. 

이 경우 직사각형의 둘레는 14가 된다. 직사각형의 가로와 세로 길이는 반드시 1 이상이어야 한다.

조약돌의 개수 N이 주어졌을 때, 조약돌을 좌표평면의 격자점에 적절히 떨어뜨려서 모든 조약돌을 포함하는 직사각형의 둘레를 최소로 하는 프로그램을 작성하시오.
'''
'''
1x1, 2x2 .. 크기의 사각형 별로, 점을 최대 몇개 놓을수 있는지 계산
'''
n = int(input())  # 조약돌의 개수

width, hegith = 1, 1
# 가로,세로의 길이를 단계별로 달리하며 수를 늘려나가며 조건확인
while True:
    # 현재 만들어진 사각형에서 점을 놓을수 있다면
    if (width+1)*(hegith+1) >= n:
        break  # 반복 종료

    # 가로를 한칸늘려서 확인
    width += 1

    # 현재 만들어진 사각형에서 점을 놓을수 있다면
    if (width+1)*(hegith+1) >= n:
        break  # 반복 종료

    # 세로를 한칸늘려서 확인
    hegith += 1

    # 현재 만들어진 사각형에서 점을 놓을수 있다면
    if (width+1)*(hegith+1) >= n:
        break  # 반복 종료
print(2*(width+hegith))
